"""
5. Реализовать структуру «Рейтинг», представляющую собой набор натуральных чисел, который не возрастает.
У пользователя нужно запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввёл число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввёл число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввёл число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать срМихайловичазу в коде, например, my_list = [7, 5, 3, 3, 2].
"""

#  Определение и вывод оригинального рейтинга
my_list = [7, 5, 3, 3, 2]
print(my_list)
# Запрос нового элемента рейтинга
new_el = int(input("Введите новый эл-т рейтинга: "))

#  Проверка на вхождение в список
if new_el not in set(my_list):
    #  Определение стороны вставки и вставка
    my_list.append(new_el) if new_el < max(my_list) else my_list.insert(0, new_el)
else:
    #  Определение позиции вставки внутри списка и вставка
    #  Сделано с переворотом списка на случай если данные пойдут не по порядку
    pos = len(my_list) - my_list[::-1].index(new_el)
    my_list.insert(pos, new_el)

# Вывод результата
print(my_list)
